#   -*- mode: org; fill-column: 60 -*-
#+TITLE: Master Plan
#+STARTUP: showall
#+PROPERTY: filename
:PROPERTIES:
:Name: /home/deerpig/proj/chenla/core-docs/master-plan.org
:Created: 2016-09-17T15:34@Prek Leap (11.642600N-104.919210W)
:ID: fa188367-d380-493a-b8d2-d70c12982248
:URL:
:END:
#+INCLUDE: ./inc/head.org
#+INCLUDE: ./inc/macros.org

{{{breadcrumbs}}}

#+HTML: <div class="outline-2" id="meta">
| *Author*  | Brad Collins <brad@chenla.org>             |
| *Date*    | {{{time(%Y-%m-%d %H:%M:%S)}}}              |
#+HTML: </div>

#+TOC: headlines 4


* Changes since version: src_sh[:results value]{git describe --abbrev=0 --tags}

#+HTML: <ul>

#+BEGIN_SRC sh :exports results :results value html :var TAG="v00.01.01"
RES=`git log $TAG...HEAD --pretty="<li>%s</li>\n" -- master-plan.org`
if [ -z $RES ]; then
RES="<li>no changes</li>"
fi
echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_EXPORT html
<li>no changes</li>
#+END_EXPORT

#+HTML: </ul>
#+HTML: </div>

